# Airthmetic and Data Alignment
When objects are added together, the respective index in the result will be the union of the index pairs.

In [1]:
import pandas as pd
import numpy as np
from pandas import DataFrame, Series

In [2]:
df1 = DataFrame(np.arange(9).reshape(3, 3),
               index=['India', 'China', 'USA'],
               columns=['a', 'b', 'c'])
df1

       a  b  c
India  0  1  2
China  3  4  5
USA    6  7  8

In [3]:
df2 = DataFrame(np.arange(12).reshape(4, 3),
               index=['India', 'USA', 'Russia', 'Italy'],
               columns=['b', 'c', 'd'])
df2

        b   c   d
India   0   1   2
USA     3   4   5
Russia  6   7   8
Italy   9  10  11

In [4]:
# simple arithmatic
df1 + df2

         a     b     c   d
China  NaN   NaN   NaN NaN
India  NaN   1.0   3.0 NaN
Italy  NaN   NaN   NaN NaN
Russia NaN   NaN   NaN NaN
USA    NaN  10.0  12.0 NaN

In [5]:
# using methods with fill values
df1.add(df2, fill_value=0)

          a     b     c     d
China   3.0   4.0   5.0   NaN
India   0.0   1.0   3.0   2.0
Italy   NaN   9.0  10.0  11.0
Russia  NaN   6.0   7.0   8.0
USA     6.0  10.0  12.0   5.0

In [6]:
df1.sub(df2, fill_value=0)

          a    b     c     d
China   3.0  4.0   5.0   NaN
India   0.0  1.0   1.0  -2.0
Italy   NaN -9.0 -10.0 -11.0
Russia  NaN -6.0  -7.0  -8.0
USA     6.0  4.0   4.0  -5.0

In [7]:
df1.mul(df2, fill_value=0)

          a     b     c    d
China   0.0   0.0   0.0  NaN
India   0.0   0.0   2.0  0.0
Italy   NaN   0.0   0.0  0.0
Russia  NaN   0.0   0.0  0.0
USA     0.0  21.0  32.0  0.0

In [8]:
df1.div(df2, fill_value=0)

          a         b    c    d
China   inf       inf  inf  NaN
India   NaN       inf  2.0  0.0
Italy   NaN  0.000000  0.0  0.0
Russia  NaN  0.000000  0.0  0.0
USA     inf  2.333333  2.0  0.0

## Operations between DataFrame and series

In [35]:
frame2 = DataFrame(np.arange(9).reshape(3, 3),
                   index=['a', 'b', 'c'], 
                   columns=["one", "two", "three"])
frame2

   one  two  three
a    0    1      2
b    3    4      5
c    6    7      8

In [40]:
series = frame2.iloc[0]
series

one      0
two      1
three    2
Name: a, dtype: int64

- By default, arithmetic between Dataframe and series matches the index of the series on the dataframe's columns, broadcasting down the rows.

In [41]:
# operation between series and dframe
frame2 - series

   one  two  three
a    0    0      0
b    3    3      3
c    6    6      6

In [50]:
frame2 + series

   one  two  three
a    0    2      4
b    3    5      7
c    6    8     10

- If an index is not found in either the dataframe's columns or the series index, the objects will be rendered to from the union which means non matching index will have NaN values.

In [59]:
series2 = Series(np.arange(3), index=['one', 'two', 'four'])
series2

one     0
two     1
four    2
dtype: int64

In [54]:
frame2

   one  two  three
a    0    1      2
b    3    4      5
c    6    7      8

In [60]:
frame2 + series2

   four  one  three  two
a   NaN  0.0    NaN  2.0
b   NaN  3.0    NaN  5.0
c   NaN  6.0    NaN  8.0

- To Broadcast over the columns, matching on the rows, use one of the arithmetic methods with axis values:
- 0: row-wise
- 1: column-wise

In [68]:
series3 = frame2.three
series3

a    2
b    5
c    8
Name: three, dtype: int64

In [69]:
# broadcasting over an 
frame2.add(series3, axis=0)

   one  two  three
a    2    3      4
b    8    9     10
c   14   15     16